grevaillot/svd_tools/headers/STM32F302/fmc.h
/** @defgroup fmc_btr2 BTR2 SRAM/NOR-Flash chip-select timing register 2
@{*/


#define FMC_BTR2_ACCMOD_SHIFT		28
#define FMC_BTR2_ACCMOD_MASK		0x03
/** @defgroup fmc_btr2_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FMC_BTR2_DATLAT_SHIFT		24
#define FMC_BTR2_DATLAT_MASK		0x0f
/** @defgroup fmc_btr2_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FMC_BTR2_CLKDIV_SHIFT		20
#define FMC_BTR2_CLKDIV_MASK		0x0f
/** @defgroup fmc_btr2_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FMC_BTR2_BUSTURN_SHIFT		16
#define FMC_BTR2_BUSTURN_MASK		0x0f
/** @defgroup fmc_btr2_busturn BUSTURN BUSTURN
@{*/
/**@}*/


#define FMC_BTR2_DATAST_SHIFT		8
#define FMC_BTR2_DATAST_MASK		0xff
/** @defgroup fmc_btr2_datast DATAST DATAST
@{*/
/**@}*/


#define FMC_BTR2_ADDHLD_SHIFT		4
#define FMC_BTR2_ADDHLD_MASK		0x0f
/** @defgroup fmc_btr2_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FMC_BTR2_ADDSET_SHIFT		0
#define FMC_BTR2_ADDSET_MASK		0x0f
/** @defgroup fmc_btr2_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_bcr3 BCR3 SRAM/NOR-Flash chip-select control register 3
@{*/

/** FMC_BCR3_CBURSTRW CBURSTRW **/
#define FMC_BCR3_CBURSTRW		(1 << 19)
/** FMC_BCR3_ASYNCWAIT ASYNCWAIT **/
#define FMC_BCR3_ASYNCWAIT		(1 << 15)
/** FMC_BCR3_EXTMOD EXTMOD **/
#define FMC_BCR3_EXTMOD		(1 << 14)
/** FMC_BCR3_WAITEN WAITEN **/
#define FMC_BCR3_WAITEN		(1 << 13)
/** FMC_BCR3_WREN WREN **/
#define FMC_BCR3_WREN		(1 << 12)
/** FMC_BCR3_WAITCFG WAITCFG **/
#define FMC_BCR3_WAITCFG		(1 << 11)
/** FMC_BCR3_WRAPMOD WRAPMOD **/
#define FMC_BCR3_WRAPMOD		(1 << 10)
/** FMC_BCR3_WAITPOL WAITPOL **/
#define FMC_BCR3_WAITPOL		(1 << 9)
/** FMC_BCR3_BURSTEN BURSTEN **/
#define FMC_BCR3_BURSTEN		(1 << 8)
/** FMC_BCR3_FACCEN FACCEN **/
#define FMC_BCR3_FACCEN		(1 << 6)

#define FMC_BCR3_MWID_SHIFT		4
#define FMC_BCR3_MWID_MASK		0x03
/** @defgroup fmc_bcr3_mwid MWID MWID
@{*/
/**@}*/


#define FMC_BCR3_MTYP_SHIFT		2
#define FMC_BCR3_MTYP_MASK		0x03
/** @defgroup fmc_bcr3_mtyp MTYP MTYP
@{*/
/**@}*/

/** FMC_BCR3_MUXEN MUXEN **/
#define FMC_BCR3_MUXEN		(1 << 1)
/** FMC_BCR3_MBKEN MBKEN **/
#define FMC_BCR3_MBKEN		(1 << 0)

/**@}*/

/** @defgroup fmc_btr3 BTR3 SRAM/NOR-Flash chip-select timing register 3
@{*/


#define FMC_BTR3_ACCMOD_SHIFT		28
#define FMC_BTR3_ACCMOD_MASK		0x03
/** @defgroup fmc_btr3_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FMC_BTR3_DATLAT_SHIFT		24
#define FMC_BTR3_DATLAT_MASK		0x0f
/** @defgroup fmc_btr3_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FMC_BTR3_CLKDIV_SHIFT		20
#define FMC_BTR3_CLKDIV_MASK		0x0f
/** @defgroup fmc_btr3_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FMC_BTR3_BUSTURN_SHIFT		16
#define FMC_BTR3_BUSTURN_MASK		0x0f
/** @defgroup fmc_btr3_busturn BUSTURN BUSTURN
@{*/
/**@}*/


#define FMC_BTR3_DATAST_SHIFT		8
#define FMC_BTR3_DATAST_MASK		0xff
/** @defgroup fmc_btr3_datast DATAST DATAST
@{*/
/**@}*/


#define FMC_BTR3_ADDHLD_SHIFT		4
#define FMC_BTR3_ADDHLD_MASK		0x0f
/** @defgroup fmc_btr3_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FMC_BTR3_ADDSET_SHIFT		0
#define FMC_BTR3_ADDSET_MASK		0x0f
/** @defgroup fmc_btr3_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_bcr4 BCR4 SRAM/NOR-Flash chip-select control register 4
@{*/

/** FMC_BCR4_CBURSTRW CBURSTRW **/
#define FMC_BCR4_CBURSTRW		(1 << 19)
/** FMC_BCR4_ASYNCWAIT ASYNCWAIT **/
#define FMC_BCR4_ASYNCWAIT		(1 << 15)
/** FMC_BCR4_EXTMOD EXTMOD **/
#define FMC_BCR4_EXTMOD		(1 << 14)
/** FMC_BCR4_WAITEN WAITEN **/
#define FMC_BCR4_WAITEN		(1 << 13)
/** FMC_BCR4_WREN WREN **/
#define FMC_BCR4_WREN		(1 << 12)
/** FMC_BCR4_WAITCFG WAITCFG **/
#define FMC_BCR4_WAITCFG		(1 << 11)
/** FMC_BCR4_WRAPMOD WRAPMOD **/
#define FMC_BCR4_WRAPMOD		(1 << 10)
/** FMC_BCR4_WAITPOL WAITPOL **/
#define FMC_BCR4_WAITPOL		(1 << 9)
/** FMC_BCR4_BURSTEN BURSTEN **/
#define FMC_BCR4_BURSTEN		(1 << 8)
/** FMC_BCR4_FACCEN FACCEN **/
#define FMC_BCR4_FACCEN		(1 << 6)

#define FMC_BCR4_MWID_SHIFT		4
#define FMC_BCR4_MWID_MASK		0x03
/** @defgroup fmc_bcr4_mwid MWID MWID
@{*/
/**@}*/


#define FMC_BCR4_MTYP_SHIFT		2
#define FMC_BCR4_MTYP_MASK		0x03
/** @defgroup fmc_bcr4_mtyp MTYP MTYP
@{*/
/**@}*/

/** FMC_BCR4_MUXEN MUXEN **/
#define FMC_BCR4_MUXEN		(1 << 1)
/** FMC_BCR4_MBKEN MBKEN **/
#define FMC_BCR4_MBKEN		(1 << 0)

/**@}*/

/** @defgroup fmc_btr4 BTR4 SRAM/NOR-Flash chip-select timing register 4
@{*/


#define FMC_BTR4_ACCMOD_SHIFT		28
#define FMC_BTR4_ACCMOD_MASK		0x03
/** @defgroup fmc_btr4_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FMC_BTR4_DATLAT_SHIFT		24
#define FMC_BTR4_DATLAT_MASK		0x0f
/** @defgroup fmc_btr4_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FMC_BTR4_CLKDIV_SHIFT		20
#define FMC_BTR4_CLKDIV_MASK		0x0f
/** @defgroup fmc_btr4_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FMC_BTR4_BUSTURN_SHIFT		16
#define FMC_BTR4_BUSTURN_MASK		0x0f
/** @defgroup fmc_btr4_busturn BUSTURN BUSTURN
@{*/
/**@}*/


#define FMC_BTR4_DATAST_SHIFT		8
#define FMC_BTR4_DATAST_MASK		0xff
/** @defgroup fmc_btr4_datast DATAST DATAST
@{*/
/**@}*/


#define FMC_BTR4_ADDHLD_SHIFT		4
#define FMC_BTR4_ADDHLD_MASK		0x0f
/** @defgroup fmc_btr4_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FMC_BTR4_ADDSET_SHIFT		0
#define FMC_BTR4_ADDSET_MASK		0x0f
/** @defgroup fmc_btr4_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_pcr2 PCR2 PC Card/NAND Flash control register 2
@{*/


#define FMC_PCR2_ECCPS_SHIFT		17
#define FMC_PCR2_ECCPS_MASK		0x07
/** @defgroup fmc_pcr2_eccps ECCPS ECCPS
@{*/
/**@}*/


#define FMC_PCR2_TAR_SHIFT		13
#define FMC_PCR2_TAR_MASK		0x0f
/** @defgroup fmc_pcr2_tar TAR TAR
@{*/
/**@}*/


#define FMC_PCR2_TCLR_SHIFT		9
#define FMC_PCR2_TCLR_MASK		0x0f
/** @defgroup fmc_pcr2_tclr TCLR TCLR
@{*/
/**@}*/

/** FMC_PCR2_ECCEN ECCEN **/
#define FMC_PCR2_ECCEN		(1 << 6)

#define FMC_PCR2_PWID_SHIFT		4
#define FMC_PCR2_PWID_MASK		0x03
/** @defgroup fmc_pcr2_pwid PWID PWID
@{*/
/**@}*/

/** FMC_PCR2_PTYP PTYP **/
#define FMC_PCR2_PTYP		(1 << 3)
/** FMC_PCR2_PBKEN PBKEN **/
#define FMC_PCR2_PBKEN		(1 << 2)
/** FMC_PCR2_PWAITEN PWAITEN **/
#define FMC_PCR2_PWAITEN		(1 << 1)

/**@}*/

/** @defgroup fmc_sr2 SR2 FIFO status and interrupt register 2
@{*/

